In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\palla\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.23.2 in c:\users\palla\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.2.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\palla\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\palla\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\palla\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\palla\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.1.1
[notice] To update, run: C:\Users\palla\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd
import numpy as np

In [3]:
#creating a data
s1=pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
s2=pd.Series(["cse","B.tech","ists"])
s2

0       cse
1    B.tech
2      ists
dtype: object

In [5]:
#creating string and int
s3=pd.Series([1,22,33,"kalyani","pallavi"])
s3

0          1
1         22
2         33
3    kalyani
4    pallavi
dtype: object

In [6]:
#creating the index
s4=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s4

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
s5=pd.Series([22,33,445,55,77],index=['1','2','3','4','5'],dtype="float")
s5

1     22.0
2     33.0
3    445.0
4     55.0
5     77.0
dtype: float64

In [8]:
s6=pd.Series({"e":33,"f":44,"r":54})
s6

e    33
f    44
r    54
dtype: int64

In [9]:
#create a dataframe
d1=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
print(d1)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [10]:
d2=pd.DataFrame([["cse","ai","m1"],["hi","hello","gdm"]])
d2

     0      1    2
0  cse     ai   m1
1   hi  hello  gdm

In [11]:
d3=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=["a","b","c"])
d3

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [47]:
d4=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=["a","b","c"],index=["d","e","f"])
d4

   a  b  c
d  1  2  3
e  4  5  6
f  7  8  9

In [48]:
#dataframe[coloumname] to access
d4['a']

d    1
e    4
f    7
Name: a, dtype: int64

In [49]:
# d4.pop('a') #for this i am immediate to pop all coloumns so there is no columns present in d4 then i create dataframe
d4=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],columns=["a","b","c"],index=["d","e","f"])
d4

   a  b  c
d  1  2  3
e  4  5  6
f  7  8  9

In [50]:
d4.pop('a')

d    1
e    4
f    7
Name: a, dtype: int64

In [51]:
d4

   b  c
d  2  3
e  5  6
f  8  9

In [52]:
del d4['b'] #onlu del the overall column but it doesn't show then we again call the dataset

In [53]:
d4

   c
d  3
e  6
f  9

In [54]:
#insertio of elements
#(which index place we want insert that location,newcoloumnname,alreadyexistingcolumn(this column copy to new column values))
d4.insert(1,"d",d4["c"])
d4.insert(0,"f",d4["c"])
d4

   f  c  d
d  3  3  3
e  6  6  6
f  9  9  9

In [58]:
"random module"
d5=pd.DataFrame({"abc":np.random.randint(2,6,size=(10)),"bcd":np.random.randint(3,11,size=(10)),"cda":np.random.randint(1,100,size=(10))})
d5

   abc  bcd  cda
0    4    3    6
1    3   10   85
2    4    6    3
3    4    3   18
4    2    6   50
5    5    5   16
6    2    5   78
7    4    9   46
8    4    3   21
9    3    4   98

In [59]:
d5.head()

   abc  bcd  cda
0    4    3    6
1    3   10   85
2    4    6    3
3    4    3   18
4    2    6   50

In [60]:
d5.tail()

   abc  bcd  cda
5    5    5   16
6    2    5   78
7    4    9   46
8    4    3   21
9    3    4   98

In [63]:
#to extract the values throught loc function also
#loc(rowname,columnname)
d5.loc[4,'abc']

2

In [73]:
#throught slice operater we can extract some values 
d5.loc[5:10,"bcd":"cda"]

   bcd  cda
5    5   16
6    5   78
7    9   46
8    3   21
9    4   98

In [77]:
#particular row names and coloumn name we want to access then mention that that row andcolumns onlu
d5.loc[[3,4,5],["abc","bcd"]]

   abc  bcd
3    4    3
4    2    6
5    5    5

In [80]:
#here which coloum and ehich row values we want to access that index names we want to specify
d5.iloc[2:7,[0,1]]

   abc  bcd
2    4    6
3    4    3
4    2    6
5    5    5
6    2    5

In [86]:
#we want print particular column values then we want to mention the column name
d5.abc.values

array([4, 3, 4, 4, 2, 5, 2, 4, 4, 3])

In [87]:
d5["abc1"]=d5.bcd.values-d5.cda.values

In [88]:
d5

   abc  bcd  cda  abc1
0    4    3    6    -3
1    3   10   85   -75
2    4    6    3     3
3    4    3   18   -15
4    2    6   50   -44
5    5    5   16   -11
6    2    5   78   -73
7    4    9   46   -37
8    4    3   21   -18
9    3    4   98   -94

In [89]:
d5["abc2"]=d5.abc.values+d5.abc1.values
d5

   abc  bcd  cda  abc1  abc2
0    4    3    6    -3     1
1    3   10   85   -75   -72
2    4    6    3     3     7
3    4    3   18   -15   -11
4    2    6   50   -44   -42
5    5    5   16   -11    -6
6    2    5   78   -73   -71
7    4    9   46   -37   -33
8    4    3   21   -18   -14
9    3    4   98   -94   -91

In [94]:
a=[["ab",1,200000],["bc",2,300000],["cd",3,400000]]
b=pd.DataFrame(a,columns=["name","is","salary"])
b

  name  is  salary
0   ab   1  200000
1   bc   2  300000
2   cd   3  400000

In [99]:
b[b.salary>=2000]

  name  is  salary
0   ab   1  200000
1   bc   2  300000
2   cd   3  400000